problems/+kamojjala/@Uniaxial2d/meshes/unitCube16x16_grading/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        nFaces          16;
        startFace       976;
    }
    left
    {
        type            wall;
        nFaces          32;
        startFace       992;
    }
    right
    {
        type            wall;
        nFaces          32;
        startFace       1024;
    }
    bottom
    {
        type            wall;
        nFaces          16;
        startFace       1056;
    }
    back
    {
        type            empty;
        nFaces          512;
        startFace       1072;
    }
    front
    {
        type            empty;
        nFaces          512;
        startFace       1584;
    }
)


// ************************************************************************* //
